In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

1.2.4

In [4]:
A = pd.Series([2,3,4,5],index=['a', 'b', 'c','d'])

In [5]:
type(A.values)

numpy.ndarray

In [6]:
type(A)

pandas.core.series.Series

In [7]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
A['a']

2

In [9]:
A['a':'c']

a    2
b    3
c    4
dtype: int64

In [10]:
grads_dict = {'A':4, 'B':3.5, 'C':3, 'D':2.5}
grads = pd.Series(grads_dict)

In [12]:
grads.values

array([4. , 3.5, 3. , 2.5])

In [13]:
marks_dict = {'A':85,'B':75,'C':65,'D':55}
marks = pd.Series(marks_dict)

In [14]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [15]:
marks['A']

85

In [17]:
marks[0:2]

A    85
B    75
dtype: int64

In [18]:
 grads

A    4.0
B    3.5
C    3.0
D    2.5
dtype: float64

In [21]:
D = pd.DataFrame({'Marks':marks,'Grades':grads})

In [22]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [23]:
D.T

           A     B     C     D
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.5   3.0   2.5

In [24]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [25]:
D.values

array([[85. ,  4. ],
       [75. ,  3.5],
       [65. ,  3. ],
       [55. ,  2.5]])

In [26]:
D.values[2,0]

65.0

In [27]:
D.columns

Index(['Marks', 'Grades'], dtype='object')

In [28]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [29]:
D['ScaledMarks'] = 100*(D['Marks']/90)

In [30]:
D

   Marks  Grades  ScaledMarks
A     85     4.0    94.444444
B     75     3.5    83.333333
C     65     3.0    72.222222
D     55     2.5    61.111111

In [31]:
del D['ScaledMarks']

In [32]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [33]:
G = D[D['Marks']>70]

In [34]:
G

   Marks  Grades
A     85     4.0
B     75     3.5

In [37]:
A = pd.DataFrame([{'a':1, 'b':4},{'b':-3,'c':9}])

In [38]:
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [39]:
A.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [43]:
A.dropna?

Signature: A.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. versionchanged:: 1.0.0

       Pass tuple or list to drop on multiple axes.
       Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

Returns
-------
DataFrame or None
    DataFrame with NA entries dropped from it or None if ``inplace=True``.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'toy'])
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep the DataFrame with valid entries in the same variable.

>>> df.dropna(inplace=True)
>>> df
     name        toy       born
1  Batman  Batmobile 1940-04-25
File:      c:\users\mathe\appdata\local\programs\python\python39\lib\site-packages\pandas\core\frame.py
Type:      method

In [44]:
A = pd.Series(['a', 'b', 'c'],index =[1,3,5])

In [45]:
A[1]

'a'

In [46]:
A[1:3]

3    b
5    c
dtype: object

In [47]:
A.loc[1:3]

1    a
3    b
dtype: object

In [48]:
A.loc[1:3]

1    a
3    b
dtype: object

In [49]:
A.iloc[1:3]

3    b
5    c
dtype: object

In [50]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [51]:
D.iloc[2,:]

Marks     65.0
Grades     3.0
Name: C, dtype: float64

In [52]:
D.iloc[::-1,:]

   Marks  Grades
D     55     2.5
C     65     3.0
B     75     3.5
A     85     4.0

In [167]:
from sklearn.impute import SimpleImputer

In [177]:
df = pd.read_csv('C:/Users/mathe/Downloads/vgsales.csv')

In [178]:
df.head(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
9,10,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,0.47,28.31

In [ ]:
df.drop(['SNo','Last Update'],axis=1,inplace=True)

In [190]:
df.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [192]:
df.rename(columns={'Rank':'Position','Name':'Game','Platform':'Console'},inplace=True)

In [193]:
df.head()

,Position,Game,Console,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [ ]:
df['Year'] = pd.to_datime(df['Year'])

In [194]:
df.head()

,Position,Game,Console,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [196]:
df.describe()

,Position,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [197]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Position      16598 non-null  int64
 1   Game          16598 non-null  object
 2   Console       16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [200]:
df = df.fillna('NA')

In [201]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Position      16598 non-null  int64
 1   Game          16598 non-null  object
 2   Console       16598 non-null  object
 3   Year          16598 non-null  object
 4   Genre         16598 non-null  object
 5   Publisher     16598 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(5), int64(1), object(5)
memory usage: 1.4+ MB

In [202]:
df.head(10)

,Position,Game,Console,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
9,10,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,0.47,28.31

In [207]:
df2 = df.groupby('Console')[['Year','Genre','Publisher','NA_Sales']].sum().reset_index()

In [209]:
df2 = df.groupby(['Console','Year'])[['Console','Year','Genre','Publisher','NA_Sales']].sum().reset_index()

In [210]:
df2

    Console    Year  NA_Sales
0      2600  1980.0     10.59
1      2600  1981.0     33.40
2      2600  1982.0     26.92
3      2600  1983.0      5.44
4      2600  1984.0      0.26
..      ...     ...       ...
252      XB      NA      4.63
253    XOne  2013.0     11.80
254    XOne  2014.0     30.41
255    XOne  2015.0     34.29
256    XOne  2016.0      6.69

[257 rows x 3 columns]

In [211]:
df3 = df2[df2['NA_Sales']>7]

In [212]:
df3

    Console    Year  NA_Sales
0      2600  1980.0     10.59
1      2600  1981.0     33.40
2      2600  1982.0     26.92
10     2600      NA      9.82
13      3DS  2011.0     26.98
..      ...     ...       ...
248      XB  2005.0     34.84
249      XB  2006.0      7.47
253    XOne  2013.0     11.80
254    XOne  2014.0     30.41
255    XOne  2015.0     34.29

[118 rows x 3 columns]

In [213]:
df3.head(20)

   Console    Year  NA_Sales
0     2600  1980.0     10.59
1     2600  1981.0     33.40
2     2600  1982.0     26.92
10    2600      NA      9.82
13     3DS  2011.0     26.98
14     3DS  2012.0     17.04
15     3DS  2013.0     15.33
16     3DS  2014.0     12.03
28      DS  2004.0      8.42
29      DS  2005.0     48.47
30      DS  2006.0     50.63
31      DS  2007.0     76.36
32      DS  2008.0     79.40
33      DS  2009.0     62.41
34      DS  2010.0     42.36
35      DS  2011.0     15.29
42      GB  1989.0     39.81
45      GB  1992.0     13.10
48      GB  1996.0     12.66
50      GB  1998.0      9.44